#include "speed.h"

//値を変える時は必ずrepverswを更新しそのファイルを残して置いてください
// Beginnerモードレベルアップテーブル
int32_t		lvTableBeg[101] =
{
	   1,   1,   2,   3,   4,   5,   6,   8,  12,  15,	// 0*
	   1,   2,   3,   6,   8,  10,  12,  15,  20,  30,	// 1*
	   2,   4,   6,  10,  15,  20,  30,  45,  60,  60,	// 2*
	  60,  60,  60,  60,  10,  20,  30,  60,  60,  60,	// 3*
	  60,  60,  60,  60,  60,  60,  60,  60,  60,  60,	// 4*
	  60,  60,  60,  60,  60,  60,  60,  60,  60,  60,	// 5*
	 120, 120, 120, 120, 120, 120, 120, 120, 120, 120,	// 6*
	 120, 120, 120, 120, 120, 240, 240, 240, 240, 240,	// 7*
	 240, 240, 240, 240, 240, 240, 240, 240, 240, 240,	// 8*
	 300, 300, 300, 300, 300, 300, 300, 300, 300, 300,	// 9*
	1200
};

// Ver39までのBeginnerモードレベルアップテーブル
int32_t		lvTableBeg39[101] =
{
	   2,   3,   4,   5,   6,   8,  10,  12,  15,  20,	// 0*
	   1,   1,   2,   4,   6,  10,  12,  15,  20,  30,	// 1*
	   2,   4,   6,  10,  15,  20,  30,  45,  60,  60,	// 2*
	  60,  60,  60,  60,  10,  20,  30,  60,  60,  60,	// 3*
	  60,  60,  60,  60,  60,  60,  60,  60,  60,  60,	// 4*
	  60,  60,  60,  60,  60,  60,  60,  60,  60,  60,	// 5*
	 120, 120, 120, 120, 120, 120, 120, 120, 120, 120,	// 6*
	 120, 120, 120, 120, 120, 240, 240, 240, 240, 240,	// 7*
	 240, 240, 240, 240, 240, 240, 240, 240, 240, 240,	// 8*
	 300, 300, 300, 300, 300, 300, 300, 300, 300, 300,	// 9*
	1200
};

// Heboris Masterモード前半レベルアップテーブル
int32_t		lvTable[31] =
{
//	  +0,  +1,  +2,  +3,  +4,  +5
	   1,   2,   3,   5,   6,   8,	//  0+
	  10,  12,  15,  20,  30,  30,	//  6+
	   1,   5,  12,  30,  60,  60,	// 12+
	  60,  60,  60, 120, 120, 180,	// 18+
	 180, 240, 300, 300, 240, 180,	// 24+
	1200
};

// TGM Masterモード前半レベルアップテーブル #1.60c3
int32_t lvTableTgm[51] =
{
     // *00, *10, *20, *30, *40, *50, *60, *70, *80, *90
	1  , 1  , 1  , 2  , 3  , 4  , 5  , 6  , 8  , 12 ,// 0**
	15 , 15 , 15 , 15 , 23 , 23 , 23 , 23 , 30 , 30 ,// 1**
	1  , 2  , 8  , 15 , 30 , 60 , 60 , 60 , 60 , 60 ,// 2**
	120, 120, 120, 180, 180, 180, 240, 240, 240, 240,// 3**
	300, 300, 300, 300, 240, 240, 240, 180, 180, 180,// 4**
	1200
	};

// ver20まで TGM Masterモード前半レベルアップテーブル #1.60c3
int32_t lvTableTgm20[51] =
{
//	 *00, *10, *20, *30, *40, *50, *60, *70, *80, *90
	   1,   1,   1,   2,   3,   4,   5,   6,   8,  12,	// 0**
	  30,  30,  30,  30,  46,  46,  46,  60,  60,  60,	// 1**
	   1,   2,   8,  15,  30,  60, 120, 120, 120, 120,	// 2**
	 240, 240, 240, 360, 360, 360, 480, 480, 480, 480,	// 3**
	 600, 600, 600, 600, 480, 480, 480, 360, 360, 360,	// 4**
	1200
};
int32_t		orimasterlvTable[31] =			// オリジナルマスター30までレベルアップ用テープル
{
	  2,   3,   5,   6,   8,  10,  12,  15,  20,  30,
	 30,   1,   5,  12,  30,  60,  60,  60,  60,  60,
	120, 120, 180, 180, 240, 300, 300, 240, 180,1200,
	1200
};

// Beginnerモード初期値
int32_t	wait1_Beginner = 26;		// 固定→次
int32_t	wait2_Beginner = 40;		// ブロック消去
int32_t	wait3_Beginner = 28;		// 接地→固定
int32_t	waitt_Beginner = 15;		// 横溜め

// Masterモード初期値
int32_t	wait1_master_half = 26;		// 固定→次
int32_t	wait2_master_half = 40;		// ブロック消去
int32_t	wait3_master_half = 28;		// 接地→固定
int32_t	waitt_master_half = 15;		// 横溜め

// 20Gモード初期値
int32_t	wait1_20G_half = 26;		// 固定→次
int32_t	wait2_20G_half = 40;		// ブロック消去
int32_t	wait3_20G_half = 28;		// 接地→固定
int32_t	waitt_20G_half = 12;		// 横溜め

// Master・20Gモード後半レベルアップテーブル
int32_t		wait1_master_tbl[28] =	// 固定→次
{
//	 500, 550, 600, 650, 700, 750, 800, 850, 900, 950,1000,1050,1100,1150,1200,1250,1300,1350,1400,1450,1500,1550,1600,1650,1700,1750,1800,1850
	  25,  25,  25,  25,  19,  19,  14,  14,  14,  14,   8,   8,   7,   7,   7,   7,   7,	7,   7,   7,   7,   7,   6,   6,   5,   4,   3,   2
};
int32_t		wait2_master_tbl[28] =	// ブロック消去
{
//	 500, 550, 600, 650, 700, 750, 800, 850, 900, 950,1000,1050,1100,1150,1200,1250,1300,1350,1400,1450,1500,1550,1600,1650,1700,1750,1800,1850
	  29,  29,  19,  19,   9,   9,   6,   6,   6,   6,   6,   6,   6,   6,   6,   6,   6,	6,   6,   6,   6,   6,   6,   6,   4,   4,   3,   1
};
int32_t		wait3_master_tbl[28] =	// 接地→固定
{
//	 500, 550, 600, 650, 700, 750, 800, 850, 900, 950,1000,1050,1100,1150,1200,1250,1300,1350,1400,1450,1500,1550,1600,1650,1700,1750,1800,1850
	  28,  28,  28,  28,  28,  28,  28,  28,  18,  18,  16,  16,  15,  15,  15,  15,  15,  15,  15,  15,  15,  15,  14,  14,  12,  11,  10,   9
};
int32_t		waitt_master_tbl[28] =	// 横溜め
{
//	 500, 550, 600, 650, 700, 750, 800, 850, 900, 950,1000,1050,1100,1150,1200,1250,1300,1350,1400,1450,1500,1550,1600,1650,1700,1750,1800,1850
	  10,  10,  10,  10,  10,  10,  10,  10,   9,   9,   9,   9,   8,   8,   8,   8,   8,   8,   8,   8,   8,   8,   8,   8,   7,   6,   6,   6
};

// 53までのMaster・20Gモード後半レベルアップテーブル
int32_t		wait1_master_tbl53[28] =	// 固定→次
{
	  25,25,25,25,19,19,13,13,13,13, 7, 7, 6, 6, 6, 6, 6, 6, 6, 6, 5, 5, 3, 3, 2, 2, 2, 2
};
int32_t		wait2_master_tbl53[28] =	// ブロック消去
{
	  29,29,19,19, 9, 9, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 4, 2, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0
};
int32_t		wait3_master_tbl53[28] =	// 接地→固定
{
	  27,27,27,27,27,27,27,27,17,17,15,15,14,14,14,14,12,11,11,11,10,10,10,10, 9, 9, 9, 9
};
int32_t		waitt_master_tbl53[28] =	// 横溜め
{
	  10,10,10,10,10,10,10,10, 9, 9, 9, 9, 8, 8, 8, 8, 8, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7
};

// 34までのMaster・20Gモード後半レベルアップテーブル
int32_t		wait1_master_tbl34[28] =	// 固定→次
{
	  25,25,24,23,15,15,13,12,11,10, 9, 9, 8, 8, 8, 7, 7, 7, 6, 6, 5, 5, 3, 3, 2, 2, 2, 2
};
int32_t		wait2_master_tbl34[28] =	// ブロック消去
{
	  27,27,17,17,10, 9, 6, 5, 3, 2, 3, 3, 2, 2, 2, 2, 1, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0
};
int32_t		wait3_master_tbl34[28] =	// 接地→固定
{
	  28,27,26,26,25,25,24,24,12,12,12,12,12,12,11,11,11,11,11,11,10,10,10,10, 9, 9, 9, 9
};
int32_t		waitt_master_tbl34[28] =	// 横溜め
{
	  11,11,11,11,10,10,10,10, 9, 9, 9, 9, 9, 9, 8, 8, 8, 8, 8, 8, 7, 7, 7, 7, 7, 7, 7, 7
};

// 28までMaster・20Gモード後半レベルアップテーブル
int32_t		wait1_master_tbl28[28] =	// 固定→次
{
	  27,27,25,25,18,18,16,15,12,10, 9, 9, 8, 8, 8, 7, 7, 7, 6, 6, 5, 5, 3, 3, 2, 2, 2, 2
};
int32_t		wait2_master_tbl28[28] =	// ブロック消去
{
	  25,22,18,15,10, 9, 6, 5, 3, 2, 3, 3, 3, 3, 2, 2, 2, 2, 2, 2, 1, 1, 1, 1, 0, 0, 0, 0
};
int32_t		wait3_master_tbl28[28] =	// 接地→固定
{
	  28,28,24,24,20,20,18,18,16,15,15,15,15,14,14,13,13,13,13,12,12,12,11,11,10,10, 9, 9
};
int32_t		waitt_master_tbl28[28] =	// 横溜め
{
	   9, 9, 9, 9, 8, 8, 8, 8, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 6, 6, 6, 6, 6, 6, 6, 6, 5, 5
};

// Devil-DOOMモードレベルアップテーブル
int32_t		wait1_doom_tbl[14] =	// 固定→次
{
//	   0, 100, 200, 300, 400, 500, 600, 700, 800, 900,1000,1100,1200,1300
	  11,  10,   9,   6,   6,   5,   4,   4,   4,   4,   6,   4,   3,   3
};
int32_t		wait2_doom_tbl[14] =	// ブロック消去
{
//	   0, 100, 200, 300, 400, 500, 600, 700, 800, 900,1000,1100,1200,1300
	   8,   5,   5,   4,   4,   3,   3,   3,   3,   3,   2,   2,   2,   2
};
int32_t		wait3_doom_tbl[14] =	// 接地→固定
{
//	   0, 100, 200, 300, 400, 500, 600, 700, 800, 900,1000,1100,1200,1300
	  20,  18,  16,  13,  13,  12,  11,  11,  11,  11,  11,  10,   9,   9
};
int32_t		waitt_doom_tbl[14] =	// 横溜め
{
//	   0, 100, 200, 300, 400, 500, 600, 700, 800, 900,1000,1100,1200,1300
	   9,   8,   7,   7,   7,   6,   5,   5,   5,   5,   5,   5,   5,   5
};
// Ver61以前のレベルアップテーブル
int32_t		wait1_doom_tbl61[14] =	// 固定→次
{
	  11,  10,   9,   5,   5,   5,   4,   4,   4,   4,   6,   4,   3,   3
};
int32_t		wait2_doom_tbl61[14] =	// ブロック消去
{
	   8,   5,   5,   4,   4,   3,   3,   3,   3,   3,   2,   2,   2,   2
};
int32_t		wait3_doom_tbl61[14] =	// 接地→固定
{
	  20,  18,  16,  12,  12,  12,  11,  11,  11,  11,  11,  10,   9,   9
};
int32_t		waitt_doom_tbl61[14] =	// 横溜め
{
	   9,   8,   7,   7,   7,   6,   5,   5,   5,   5,   5,   5,   5,   5
};

// Ver59以前のレベルアップテーブル  速度をSHIRASEに　C7U1.7
int32_t		wait1_devil_tbl[14] =	// 固定→次
{
	  11,   7,   6,   4,   4,   3,   3,   3,   3,   3,   4,   3,   3,   3
};
int32_t		wait2_devil_tbl[14] =	// ブロック消去
{
	   8,   5,   4,   4,   4,   3,   3,   3,   3,   3,   2,   2,   1,   1
};
int32_t		wait3_devil_tbl[14] =	// 接地→固定
{
	  20,  20,  18,  14,  14,  14,  12,  12,  12,  12,  12,  11,   9,   9
};
int32_t		waitt_devil_tbl[14] =	// 横溜め
{
	  10,  10,   9,   7,   7,   7,   6,   6,   6,   6,   6,   6,   5,   5
};

// DEVILモードせり上がり(devil_randrise = 1 の時)用
int32_t		devil_rise_min[14] =
{
//	   0, 100, 200, 300, 400, 500, 600, 700, 800, 900,1000,1100,1200,1300
	   0,   0,   0,   0,   0,  25,  20,  10,   8,   5,   0,   0,   0,   0
};
int32_t		devil_rise_max[14] =
{
//	   0, 100, 200, 300, 400, 500, 600, 700, 800, 900,1000,1100,1200,1300
	   0,   0,   0,   0,   0,  35,  30,  20,  18,  15,   0,   0,   0,   0
};


// ver32以前のDevilモードレベルアップテーブル
int32_t		wait1_devil_tbl32[14] =	// 固定→次
{
	  10, 9, 8, 7, 6, 5, 5, 4, 4, 3, 5, 4, 3, 2
};
int32_t		wait2_devil_tbl32[14] =	// ブロック消去
{
	   4, 4, 4, 4, 4, 3, 3, 3, 3, 3, 2, 2, 1, 0
};
int32_t		wait3_devil_tbl32[14] =	// 接地→固定
{
	  20,20,19,19,18,17,16,14,13,13,13,12,12,10
};
int32_t		waitt_devil_tbl32[14] =	// 横溜め
{
	  10,10,10, 9, 9, 9, 9, 8, 7, 7, 6, 6, 6, 6
};

// ver17以前のDevilモードレベルアップテーブル
int32_t		wait1_devil_tbl17[14] =	// 固定→次
{
	  18,16,14,10, 8, 7, 6, 5, 4, 3, 5, 5, 4, 5
};
int32_t		wait2_devil_tbl17[14] =	// ブロック消去
{
	  13,11,10, 9, 8, 7, 7, 6, 6, 5, 5, 5, 5, 5
};
int32_t		wait3_devil_tbl17[14] =	// 接地→固定
{
	  28,26,25,22,20,17,16,14,13,13,13,13,13,13
};
int32_t		waitt_devil_tbl17[14] =	// 横溜め
{
	  10,10,10, 9, 9, 9, 9, 8, 7, 7, 7, 7, 7, 7
};

// ver18のDevilモードレベルアップテーブル
int32_t		wait1_devil_tbl18[14] =	// 固定→次
{
	  18,16,14,10, 8, 7, 6, 5, 4, 3, 5, 4, 3, 2
};
int32_t		wait2_devil_tbl18[14] =	// ブロック消去
{
	   4, 4, 4, 4, 4, 3, 3, 3, 3, 3, 2, 2, 1, 0
};
int32_t		wait3_devil_tbl18[14] =	// 接地→固定
{
	  20,20,20,20,18,17,16,14,13,13,13,12,12,10
};
int32_t		waitt_devil_tbl18[14] =	// 横溜め
{
	  10,10,10, 9, 9, 9, 9, 8, 7, 7, 6, 6, 6, 6
};

// Devilマイナスモードレベルアップテーブル
int32_t		wait1_devil_m_tbl[14] =	// 固定→次
{
//	   0, 100, 200, 300, 400, 500, 600, 700, 800, 900,1000,1100,1200,1300
	  15,  14,  14,   8,   7,   7,   7,   7,   7,   7,   7,   7,   7,   7
};
int32_t		wait2_devil_m_tbl[14] =	// ブロック消去
{
//	   0, 100, 200, 300, 400, 500, 600, 700, 800, 900,1000,1100,1200,1300
	   8,   0,   0,   6,   5,   5,   5,   5,   5,   5,   5,   5,   5,   5
};
int32_t		wait3_devil_m_tbl[14] =	// 接地→固定
{
//	   0, 100, 200, 300, 400, 500, 600, 700, 800, 900,1000,1100,1200,1300
	  30,  26,  22,  18,  15,  15,  15,  15,  15,  15,  15,  15,  15,  15
};
int32_t		waitt_devil_m_tbl[14] =	// 横溜め
{
//	   0, 100, 200, 300, 400, 500, 600, 700, 800, 900,1000,1100,1200,1300
	  12,  12,  11,  10,   8,   8,   8,   8,   8,   8,   8,   8,   8,   8
};

int32_t		wait1_orimaster_tbl[11] = 	// オリジナルマスター・20Gモードレベルアップテーブル
{
	  27,  27,  27,  27,  18,  18,  16,  15,  14,  14,  13
};
int32_t		wait2_orimaster_tbl[11] =
{
	  25,  22,  18,  15,  12,  10,   8,   6,   5,   4,   3
};
int32_t		wait3_orimaster_tbl[11] =
{
	  28,  28,  28,  28,  28,  28,  28,  28,  28,  22,  15
};
int32_t		waitt_orimaster_tbl[11] =
{
	   9,   9,   9,   9,   8,   8,   8,   8,   7,   7,   7,
};

int32_t		wait1_oridevil_tbl[11] = 	// オリジナルデビルモードレベルアップテーブル
{
	  18,  16,  14,  12,  10,  9,  8,  8,  7,  6,  5
};
int32_t		wait2_oridevil_tbl[11] =
{
	  13,  11,   10,   9,   8,   7,  7,  6,  6,  5,   5
};
int32_t		wait3_oridevil_tbl[11] =
{
	  28,  26,  25,  23, 20,  16,   15, 14,  13,13,  13
};
int32_t		waitt_oridevil_tbl[11] =
{
	  10,  10, 10,  9 , 9, 9,  9, 8,    7, 7,  7
};


// Beginnerモードロール用(TIME TRIAL, Level 200)
int32_t	speed_beginner_roll = 1200;	// 落下速度(1200 = 20G)
int32_t	wait1_beginner_roll = 26;	// 固定→次
int32_t	wait2_beginner_roll = 40;	// ブロック消去
int32_t	wait3_beginner_roll = 28;	// 接地→固定
int32_t	waitt_beginner_roll = 15;	// 横溜め

//Master・20Gモードロール用(TIME TRIAL, Level 999)
int32_t	speed_master_roll = 1200;	// 落下速度(1200 = 20G)

// 段位4設定時のMASTER&20Gロール
int32_t	wait1_master_rollG4 = 3;	// 固定→次
int32_t	wait2_master_rollG4 = 4;	// ブロック消去
int32_t	wait3_master_rollG4 = 15;	// 接地→固定
int32_t	waitt_master_rollG4 = 7;	// 横溜め

// 段位2・3設定時のMASTER&20Gロール
int32_t	wait1_master_roll = 10;		// 固定→次
int32_t	wait2_master_roll = 3;		// ブロック消去
int32_t	wait3_master_roll = 16;		// 接地→固定
int32_t	waitt_master_roll = 8;		// 横溜め

// Ver38以前のMASTER&20Gロール
int32_t	wait1_master_roll38 = 10;	// 固定→次
int32_t	wait2_master_roll38 = 2;	// ブロック消去
int32_t	wait3_master_roll38 = 15;	// 接地→固定
int32_t	waitt_master_roll38 = 7;	// 横溜め

// DEVILモードロール用(TIME TRIAL, Level 1300)
int32_t	speed_devil_roll = 1200;	// 落下速度(1200 = 20G)

int32_t	wait1_devil_roll = 2;		// 固定→次
int32_t	wait2_devil_roll = 6;		// ブロック消去
int32_t	wait3_devil_roll = 14;		// 接地→固定
int32_t	waitt_devil_roll = 7;		// 横溜め

// Ver56以前のDEVILロール
int32_t	wait1_devil_roll56 = 3;		// 固定→次
int32_t	wait2_devil_roll56 = 7;		// ブロック消去
int32_t	wait3_devil_roll56 = 15;	// 接地→固定
int32_t	waitt_devil_roll56 = 7;		// 横溜め

// Ver38以前のDEVILロール
int32_t	wait1_devil_roll38 = 5;		// 固定→次
int32_t	wait2_devil_roll38 = 3;		// ブロック消去
int32_t	wait3_devil_roll38 = 13;	// 接地→固定
int32_t	waitt_devil_roll38 = 7;		// 横溜め

// Ver17以前のDEVILロール
int32_t	wait1_devil_roll17 = 5;		// 固定→次
int32_t	wait2_devil_roll17 = 5;		// ブロック消去
int32_t	wait3_devil_roll17 = 13;	// 接地→固定
int32_t	waitt_devil_roll17 = 7;		// 横溜め


// 遅延防止モード用
int32_t	speed_limit15 = 1200;		// 落下速度(1200 = 20G)
int32_t	wait1_limit15 = 1;			// 固定→次
int32_t	wait2_limit15 = 0;			// ブロック消去
int32_t	wait3_limit15 = 8;			// 接地→固定

// TOMOYOモードレベルアップテーブル #1.60c7m1
int32_t lvTabletomoyo[31] =
{
	   1,   2,   4,   10,  15,  23,  23,  30,  30,  30,  // 0**
	   1,   4,   8,   15,  30,  60,  60,  120, 120, 120, // 1**
	   180, 180, 240, 240, 300, 300, 240, 240, 180, 180, // 2**
	1200
};

// Ver25より前のTOMOYOモードレベルアップテーブル #1.60c7m1
int32_t lvTabletomoyo24[31] =
{
	   1,   1,   1,   2,   3,   4,   5,   6,   8,  12, // 0**
	  15,  15,  15,  15,  23,  23,  23,  30,  30,  30, // 1**
	   1,   1,   8,  15,  30,  60,  60,  60,  60,  60, // 2**
	1200
};
// TOMOYOモードレベルアップテーブル #1.60c7u6
int32_t lvTabletomoyohebo[20] =
{
	   1,   2,   3,   5,   8,  10,  12,  15,  20,  30,
	  30,   1,   5,  12,  30,  60,  60,  60,  60,  60
};

// Ver26以前のTOMOYOモードWAIT値 #1.60c7m1
int32_t	wait1_tomoyo26 = 26;		// 固定→次
int32_t	wait2_tomoyo26 = 40;		// ブロック消去
int32_t	wait3_tomoyo26 = 28;		// 接地→固定
int32_t	waitt_tomoyo26 = 15;		// 横溜め

// TOMOYOモードWAIT値
int32_t	wait1_tomoyo = 25;		// 固定→次
int32_t	wait2_tomoyo = 39;		// ブロック消去
int32_t	wait3_tomoyo = 28;		// 接地→固定
int32_t	waitt_tomoyo = 16;		// 横溜め

// VERSUSモード #1.60c7p5
int32_t	speed_versus = 1;		// 落下速度(1200 = 20G)
int32_t	wait1_versus = 26;		// 固定→次
int32_t	wait2_versus = 40;		// ブロック消去
int32_t	wait3_versus = 28;		// 接地→固定
int32_t	waitt_versus = 15;		// 横溜め

// ACEモードレベルアップテーブル
int32_t		lvTableAce[15] =
{
	1, 3, 12, 18, 24, 30, 60, 120, 150, 180, 240, 300, 1200, 1200, 1200
};
// Ver55以前のACEレベルアップテーブル
int32_t		lvTableAce55[15] =
{
	1,10, 20, 30, 60,100,130, 160, 190, 220, 240, 300, 1200, 1200, 1200
};

// ACEアナザーモードレベルアップテーブル
int32_t		lvTableAcea[15] =
{
	1200, 1200, 1200, 1200, 1200, 1200, 1200, 1200, 1200, 1200, 1200, 1200, 1200, 1200, 1200
};

// ACEモード制限時間
int32_t		timeLimitAce[15] =
{
	5400, 5400, 5400, 5400, 5400, 5400, 5400, 5400, 5400, 5400, 5400, 5400, 5400, 5400, 5400
};

// ACEアナザーモード制限時間
int32_t		timeLimitAcea[15] =
{
	3600, 3600, 3600, 3600, 3600, 3600, 3600, 3300, 3000, 2700, 2400, 2100, 1800, 1500, 1000
};
// ACEヘルモード制限時間
int32_t		timeLimitAcea2[20] =
{
	1800, 1800, 1800, 1800, 1800, 1500, 1500, 1500, 1500, 1500, 1200, 1200, 1200, 1020, 900, 1200, 1020, 900, 840, 840
};


// ACEモードWAIT値
int32_t	wait1_Ace = 26;		// 固定→次
int32_t	wait2_Ace = 40;		// ブロック消去
int32_t	wait3_Ace = 28;		// 接地→固定
int32_t	waitt_Ace = 15;		// 横溜め

// ACEアナザーモードレベルアップテーブル
int32_t		wait1_Acea_tbl[15] =	// 固定→次
{
//	 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15
	 18,14,14,14,12,12,10,8, 7,  6,  5,  5,  4,  3,  2
};
int32_t		wait2_Acea_tbl[15] =	// ブロック消去
{
//	 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15
	 14,8, 8, 5, 5, 5, 5, 5, 5,  5,  5,  5,  4,  4,  3
};
int32_t		wait3_Acea_tbl[15] =	// 接地→固定
{
//	 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15
	 28,24,22,20,18,14,14,13,13,13, 12, 12, 12, 12, 11
};
int32_t		waitt_Acea_tbl[15] =	// 横溜め
{
//	 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15
	 10,10, 9, 9, 9, 8, 8, 7, 7, 7,  7,  7,  7,  7,  7
};

// 35以前のACEアナザーモードレベルアップテーブル
int32_t		wait1_Acea_tbl35[15] =	// 固定→次
{
//	 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15
	 18,18,16,16,16,12,12,11,11, 10, 7,  7,  6,  6, 5
};
int32_t		wait2_Acea_tbl35[15] =	// ブロック消去
{
//	 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15
	 5, 5, 5, 5, 5, 4, 4, 4, 4,  4,  3,  3,  3,  3,  2
};
int32_t		wait3_Acea_tbl35[15] =	// 接地→固定
{
//	 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15
	 28,28,26,26,24,20,20,19,18,17, 14, 14, 13, 13, 12
};
int32_t		waitt_Acea_tbl35[15] =	// 横溜め
{
//	 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15
	 10,10, 9, 9, 9, 8, 8, 8, 8,  8,  7,  7,  7,  6,  6
};

// ハイスピード１レベルアップテーブル
int32_t		lvTableHiSpeed1[15] =
{
	20, 30, 60, 120, 180, 240, 300, 1200, 1200, 1200, 1200, 1200, 1200, 1200, 1200
};
int32_t	wait1_HiSpeed1 = 26;		// 固定→次
int32_t	wait2_HiSpeed1 = 40;		// ブロック消去
int32_t	wait3_HiSpeed1 = 30;		// 接地→固定
int32_t	waitt_HiSpeed1 = 12;		// 横溜め

// ハイスピード２レベルアップテーブル
int32_t	wait1_HiSpeed2 = 26;		// 固定→次
int32_t	wait2_HiSpeed2 = 40;		// ブロック消去
int32_t	wait3_HiSpeed2 = 30;		// 接地→固定
int32_t	waitt_HiSpeed2 = 12;		// 横溜め

// オールドスタイルレベルアップテーブル
int32_t		lvTableHeboGB[15] =
{
//	 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15
	 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 12, 15, 17, 20, 30
};

int32_t	wait1_HeboGB = 0;		// 固定→次

int32_t	wait2_HeboGB = 60;		// ブロック消去

int32_t		wait3_HeboGB_tbl[15] =	// 接地→固定
{
//	 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15
	 60,30,20,15,12,10,8, 8, 7, 6,  5,  4,  4,  3,  2
};
int32_t		waitt_HeboGB_tbl[15] =	// 横溜め
{
//	 1,  2, 3, 4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14, 15
	 15,15,14,14, 14, 13, 13, 13, 12, 12, 11, 11, 10, 10, 10
};
